# Задание 3. Склонение слова
# Реализовать склонение слова «процент» во фразе «N процентов».
# Вывести эту фразу на экран отдельной строкой для каждого из чисел в интервале от 1 до 100:
# 1 процент
# 2 процента
# 3 процента
# 4 процента
# 5 процентов
# 6 процентов
# ...
# 100 процентов

my_dict = {'1': 'процент', '2': 'процента', '3': 'процента', '4': 'процента',
           '21': 'процент', '22': 'процента', '23': 'процента', '24': 'процента',
           '31': 'процент', '32': 'процента', '33': 'процента', '34': 'процента',
           '41': 'процент', '42': 'процента', '43': 'процента', '44': 'процента',
           '51': 'процент', '52': 'процента', '53': 'процента', '54': 'процента',
           '61': 'процент', '62': 'процента', '63': 'процента', '64': 'процента',
           '71': 'процент', '72': 'процента', '73': 'процента', '74': 'процента',
           '81': 'процент', '82': 'процента', '83': 'процента', '84': 'процента',
           '91': 'процент', '92': 'процента', '93': 'процента', '94': 'процента'}
for percent in range(1, 101):
    percent = str(percent)
    if percent in my_dict:
        print(f'{percent} {my_dict[percent]}')
    else:
        print(f'{percent} процентов')
